import re
test = ((('Бахилин Н.В. P3134','Каримов Х.Т. U3114','Муродуллаев М.А. U3114','Егоров Е.Е. P3116'),\
            ('Бахилин Н.В. P3134','Каримов Х.Т. U3114','Муродуллаев М.А. U3114')),\
        (('Шевелев А.В. P3116','Винокурова К.К. U3114','Сиразетдинов А.Н. P3116','Егоров А.С. T3124','Шпинева У.С. P3116'),\
            ('Шевелев А.В. P3116','Винокурова К.К. U3114','Сиразетдинов А.Н. P3116','Егоров А.С. T3124','Шпинева У.С. P3116')),\
        (('Иванов-Иванов И.И. P3116', 'Данилов Т.Н. P3134','Алиев Д.Р. R3135', 'Дау М.Ш. R3135', 'Алексеев В.А. R3135'),\
            ('Данилов Т.Н. P3134','Алиев Д.Р. R3135', 'Дау М.Ш. R3135', 'Алексеев В.А. R3135')),\
        (('Алиев Д.Р. R3135','Джаватов Д.Д. P3116','Васильев В.С. R3135','Васильев К.И. R3135','Возжаева Д.А. R3135'),\
            ('Алиев Д.Р. R3135','Васильев В.С. R3135','Васильев К.И. R3135','Возжаева Д.А. R3135')),\
        (('Волович А.А. R3135','Данилин В.С. R3135','Дау М.Ш. R3135','Ткачев И.А. P3116','Бабенко Д.А. P3134'),\
            ('Волович А.А. R3135','Данилин В.С. R3135','Дау М.Ш. R3135','Ткачев И.А. P3116','Бабенко Д.А. P3134')))


for h,i in enumerate(test):
    l = re.findall(r'(\w*)-?(\w*) (\w)\. ?(\w)\. (\w\d*)','\n'.join(i[0]))#l - list
    if l is not[]:
        l=list(l)
        offset = 0
        for k in range(len(l)-1,-1,-1):
            l[k]=list(l[k])
            j=l[k]
            if j[1] == '':
                if j[0][0]==j[2]==j[3]:
                    del l[k]
                    continue
            else:
                if j[0][0]==j[1][0]==j[2]==j[3]:
                    del l[k]
                    continue
            l[k]=j[0]+(('-'+j[1]) if j[1]!='' else '')+' '+j[2]+'.'+j[3]+". "+j[4]
        print("Тест ",h)
        for k in range(len(i[0])):
            print(i[0][k],((' '*5+l[k]) if k < len(l) else ""))
        print(l == list(i[1]))
